In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [19]:
r = pd.read_csv("RELIANCE.csv")
a = pd.read_csv("ADANIENT.csv")

In [20]:
r = r.iloc[:, [0, -3]]
a = a.iloc[:, [0,-3]]

In [32]:
r.rename(columns={'Close':'Price(Reliance)'}, inplace=True)
a.rename(columns={'Close':'Price(Adani)'}, inplace=True)

In [33]:
r

         Date  Price(Reliance)
0  2024-02-02      2915.399902
1  2024-02-05      2878.050049
2  2024-02-06      2855.600098
3  2024-02-07      2884.300049
4  2024-02-08      2900.250000

In [34]:
a

         Date  Price(Adani)
0  2024-02-02   3157.449951
1  2024-02-05   3173.449951
2  2024-02-06   3203.750000
3  2024-02-07   3229.850098
4  2024-02-08   3168.600098

In [36]:
df = a.merge(r, on='Date')
df

         Date  Price(Adani)  Price(Reliance)
0  2024-02-02   3157.449951      2915.399902
1  2024-02-05   3173.449951      2878.050049
2  2024-02-06   3203.750000      2855.600098
3  2024-02-07   3229.850098      2884.300049
4  2024-02-08   3168.600098      2900.250000

In [48]:
def R(price_col):
    first_row = [0]
    for i in range(1, len(price_col)):
        first_row.append(((price_col[i]-price_col[i-1])/(price_col[i-1]))*100)
    return np.array(first_row).round(2)
df['R(A)'] = R(df.iloc[:, 1])
df['R(R)'] = R(df.iloc[:, 2])

In [49]:
df

         Date  Price(Adani)  Price(Reliance)  R(A)  R(R)
0  2024-02-02   3157.449951      2915.399902  0.00  0.00
1  2024-02-05   3173.449951      2878.050049  0.51 -1.28
2  2024-02-06   3203.750000      2855.600098  0.95 -0.78
3  2024-02-07   3229.850098      2884.300049  0.81  1.01
4  2024-02-08   3168.600098      2900.250000 -1.90  0.55